Catalogs/ИзделияЭлемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЭлемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезАртикула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АктуальныеИзделияКомплектыЭлементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АктуальныеИзделияКомплектыЭлементы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплектЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИзделияЭлемент/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда 
		Проект = Параметры.Проект;
		Если ЭтаФорма.Параметры.Свойство("ТолькоНеИспользованые") Тогда
			Если ЭтаФорма.Параметры.ТолькоНеИспользованые Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
				                      |	спрИзделияЭлемента.Ссылка КАК Ссылка,
				                      |	ВЫРАЗИТЬ(спрИзделияЭлемента.Комментарий КАК СТРОКА(150)) КАК Комментарий,
				                      |	спрИзделияЭлемента.Помещения КАК Помещения,
				                      |	спрИзделияЭлемента.Наименование КАК Наименование,
				                      |	спрИзделияЭлемента.Код КАК Код,
				                      |	спрИзделияЭлемента.НомерПоПорядку КАК НомерПоПорядку,
				                      |	ВЫБОР
				                      |		КОГДА АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент ЕСТЬ NULL
				                      |			ТОГДА ЛОЖЬ
				                      |		ИНАЧЕ ИСТИНА
				                      |	КОНЕЦ КАК Актуальность
				                      |ИЗ
				                      |	Справочник.ИзделияЭлемент КАК спрИзделияЭлемента
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.?ИзделияКомплект?.ИзделияЭлемент КАК тчКомплектИзделияЗаказчика
				                      |		ПО (тчКомплектИзделияЗаказчика.ИзделиеЭлемент = спрИзделияЭлемента.Ссылка)
				                      |			И (НЕ тчКомплектИзделияЗаказчика.Ссылка = &СсылкаРодитель)
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеИзделияКомплектыЭлементы КАК АктуальныеИзделияКомплектыЭлементы
				                      |		ПО спрИзделияЭлемента.Ссылка = АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент
				                      |ГДЕ
				                      |	спрИзделияЭлемента.Проект = &Проект
				                      |	И тчКомплектИзделияЗаказчика.Ссылка ЕСТЬ NULL
				                      |	И спрИзделияЭлемента.ЭтоГруппа = ЛОЖЬ
				                      |	И НЕ спрИзделияЭлемента.Ссылка В (&ТекущиеИзделияЗаказчика)
				                      |
				                      |СГРУППИРОВАТЬ ПО
				                      |	спрИзделияЭлемента.Ссылка,
				                      |	ВЫБОР
				                      |		КОГДА АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент ЕСТЬ NULL
				                      |			ТОГДА ЛОЖЬ
				                      |		ИНАЧЕ ИСТИНА
				                      |	КОНЕЦ,
				                      |	спрИзделияЭлемента.Помещения,
				                      |	спрИзделияЭлемента.Наименование,
				                      |	спрИзделияЭлемента.Код,
				                      |	спрИзделияЭлемента.НомерПоПорядку,
				                      |	ВЫРАЗИТЬ(спрИзделияЭлемента.Комментарий КАК СТРОКА(150))";
				
									  
				Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"?ИзделияКомплект?",	Параметры.СсылкаРодитель.Метаданные().Имя);
				Список.Параметры.УстановитьЗначениеПараметра("ТекущиеИзделияЗаказчика",		Параметры.ТекущиеИзделияЗаказчика);
				Список.Параметры.УстановитьЗначениеПараметра("СсылкаРодитель",				Параметры.СсылкаРодитель); 
				Список.ОсновнаяТаблица = "Справочник.ИзделияЭлемент";
			КонецЕсли;
		КонецЕсли;
		Список.Параметры.УстановитьЗначениеПараметра("Проект", Параметры.Проект);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Проект",Справочники.Проекты.ПустаяСсылка());
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево; 
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры
